water/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       12640;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       12720;
    }
    atmosphere
    {
        type            patch;
        nFaces          80;
        startFace       12800;
    }
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       12880;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12800;
        startFace       12960;
    }
)

// ************************************************************************* //
